#include "GameDatabase.h"
#include "../SupportCard/SupportCard.h"

// 0 模板
// 1 神团
// 2 智高峰
// 3 智美妙
// 4 根乌拉拉
// 5 根风神
// 6 水司机
// 7 根凯斯
// 8 根皇帝
// 9 根善信
// 10 速宝穴
// 11 耐海湾
// 12 智好歌剧
// 13 根黄金城
// 
//


const std::string GameDatabase::AllSupportCardNames[ALL_SUPPORTCARD_NUM] = {
  "模板",
  //1~6，我自己的卡组
  "[友]神团",
  "[智]高峰",
  "[智]美妙",
  "[根]乌拉拉",
  //5----
  "[根]风神",
  "[速]司机",
  //7~17 目前ue8用到过的卡组
  "[根]凯斯",
  "[根]皇帝",
  "[根]善信",
  //10----
  "[速]宝穴",
  "[耐]海湾",
  "[智]好歌剧",
  "[根]黄金城",
  "[智]波旁",
  //15----
  "[耐]狄杜斯",
  "[智]小栗帽",
  "[根]狄杜斯",

  //18~ 其他常用卡
  "[速]北黑",
  "[速]福来",
  //20----
  "[速]速子",

  "[耐]光钻",
  "[耐]桂冠",

  "[力]白仁",
  "[力]重炮",
  //25----
  "[力]内恰",
  "[力]神鹰",
  "[力]伏特加",

  "[根]涡轮",
  "[根]进王",
  //30----
  "[根]青竹",
  "[根]小栗帽sr",
  "[根]织姬sr",
  "[根]气槽sr",
  "[根]采珠sr",

  //35----
  "[智]东海",
  "[智]庆典",
  "[智]CB",
  "[智]小魔女",
  "[智]气槽",
  //40----
  "[智]太阳神hd",
  "[智]星云sr",
  "[智]速子sr",
  "[智]大和sr",
  "[智]福来sr",










};



const std::map<int, int> GameDatabase::AllSupportCardGameIdToSimulatorId =
{
  {0,0},
  {430137,1},
  {430134,2},
  {430010,3},
  {430019,4},
  {430011,5},
  {430107,6},
  {430130,7},
  {430037,8},
  {430027,9},
  {430147,10},
  {430016,11},
  {430152,12},
  {430153,13},
  {430141,14},
  {430099,15},
  {430146,16},
  {430063,17},
  {430028,18},
  {430078,19},
  {430101,20},
  {430,21},
  {430,22},
  {430,23},
  {430,24},
  {430,25},
  {430,26},
  {430,27},
  {430,28},
  {430,29},
  {430,30},
  {430,31},
  {430,32},
  {430,33},
  {430,34},
  {430,35},
  {430,36},
  {430,37},
  {430,38},
  {430,39},
  {430,40},
  {430,41},
  {430,42},
  {430,43},
  {430,44},
  {430,45},
  {430,46},
  {430,47},
  {430,48},
  {430,49},
};



//这里的都包括固有，不满足固有条件的会在getCardEffect里校正
SupportCard GameDatabase::AllSupportCards[ALL_SUPPORTCARD_NUM] =
{
  //0，模板
  {
    0, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    0, // 支援卡类型，0速1耐2力3根4智5友人或团队
    0, // 友情加成
    0, // 干劲加成
    0, // 训练加成
    {0, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    0, // 初始羁绊
    0, // 赛后
    {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    0  // 得意率
  },
  //1,神团
  {
    1, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    5, // 支援卡类型，0速1耐2力3根4智5友人或团队
    32, // 友情加成
    15, // 干劲加成
    10, // 训练加成
    {1, 1, 1, 0, 0, 1}, // 速耐力根智pt的加成
    2, // 智力彩圈体力回复量
    {0, 0, 35, 0, 0, 0}, // 初期速耐力根智pt的提升
    20, // 初始羁绊
    0, // 赛后
    //友人卡的各种事件会另外处理
    {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    0  // 得意率
  },
  //2,高峰
  {
    2, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    35, // 友情加成
    0, // 干劲加成
    20, // 训练加成
    {0, 0, 0, 0, 2, 1}, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    5, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 60}, // 为了简化，把红点的技能等效成多少属性
    60, // 启发发生率提升
    50  // 得意率
  },
  //3,美妙
  {
    3, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    37.5, // 友情加成
    30, // 干劲加成
    15, // 训练加成
    {0, 0, 0, 0, 1, 0}, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    {0, 0, 0, 0, 35, 0}, // 初期速耐力根智pt的提升
    15, // 初始羁绊
    10, // 赛后
    {0, 0, 0, 0, 0, 7}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    35  // 得意率
  },
  //4,乌拉拉
  {
    4, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    32, // 友情加成
    30, // 干劲加成
    15, // 训练加成
    {0, 0, 0, 0, 0, 1}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 35, 0, 0}, // 初期速耐力根智pt的提升
    0, // 初始羁绊
    10, // 赛后
    {1, 0, 1, 6, 0, 0}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    50  // 得意率
  },
  //5,根风神
  {
    5, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    20, // 友情加成
    30, // 干劲加成
    15, // 训练加成
    {1, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 35, 0, 0}, // 初期速耐力根智pt的提升
    35, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 30}, // 为了简化，把红点的技能等效成多少属性
    50, // 启发发生率提升
    80  // 得意率
  },
  //6，水司机
  {
    6, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    0, // 支援卡类型，0速1耐2力3根4智5友人或团队
    25, // 友情加成
    30, // 干劲加成
    25, // 训练加成
    {1, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    30, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 30}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    35  // 得意率
  },
  //7,根凯斯
  {
    7, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    50, // 干劲加成
    0, // 训练加成
    {0, 0, 2, 1, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 30, 0, 0, 0}, // 初期速耐力根智pt的提升
    20, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    65  // 得意率
  },
  //8,根皇帝
  {
    8, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    20, // 友情加成
    0, // 干劲加成
    10, // 训练加成
    {2, 0, 1, 2, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {20, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    25, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
    50, // 启发发生率提升
    65  // 得意率
  },
  //9,根善信
  {
    9, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    35, // 友情加成
    40, // 干劲加成
    5, // 训练加成
    {0, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 20, 0, 0}, // 初期速耐力根智pt的提升
    25, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    65  // 得意率
  },
  //10,速宝穴
  {
    10, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    0, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    0, // 干劲加成
    10, // 训练加成
    {3, 0, 1, 0, 0, 1}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {35, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    30, // 初始羁绊
    10, // 赛后
    {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    65  // 得意率
  },
  //11,耐海湾
  {
    11, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    1, // 支援卡类型，0速1耐2力3根4智5友人或团队
    37.5, // 友情加成
    0, // 干劲加成
    15, // 训练加成
    {0, 1, 0, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 35, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    30, // 初始羁绊
    10, // 赛后
    {0, 0, 0, 0, 0, 7}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    62  // 得意率
  },
  //12,智好歌剧
  {
    12, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    20, // 友情加成
    60, // 干劲加成
    10, // 训练加成
    {2, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    {0, 0, 0, 0, 20, 0}, // 初期速耐力根智pt的提升
    25, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 25}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    50  // 得意率
  },
  //13,根黄金城
  {
    13, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    30, // 干劲加成
    5, // 训练加成
    {0, 0, 1, 3, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {20, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    35, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 25}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    50  // 得意率
  },
};
