#include "GameDatabase.h"
#include "../SupportCard/SupportCard.h"

// 0 模板
// 1 神团
// 2 智高峰
// 3 智美妙
// 4 根乌拉拉
// 5 根风神
// 6 水司机
// 7 根凯斯
// 8 根皇帝
// 9 根善信
// 10 速宝穴
// 11 耐海湾
// 12 智好歌剧
//


const std::string GameDatabase::AllSupportCardNames[ALL_SUPPORTCARD_NUM] = {
  "模板",
  "神团",
  "智高峰",
  "智美妙",
  "根乌拉拉",
  "根风神",
  "水司机",
  "根凯斯",
  "根皇帝",
  "根善信",
  "速宝穴",
  "耐海湾",
  "智好歌剧",
};


//这里的都包括固有，不满足固有条件的会在getCardEffect里校正
const SupportCard GameDatabase::AllSupportCards[ALL_SUPPORTCARD_NUM] =
{
  //0，模板
  {
    0, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    0, // 支援卡类型，0速1耐2力3根4智5友人或团队
    0, // 友情加成
    0, // 干劲加成
    0, // 训练加成
    {0, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    0, // 初始羁绊
    0, // 赛后
    {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    0  // 得意率
  },
  //1,神团
  {
    1, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    5, // 支援卡类型，0速1耐2力3根4智5友人或团队
    32, // 友情加成
    15, // 干劲加成
    10, // 训练加成
    {1, 1, 1, 0, 0, 0}, // 速耐力根智pt的加成
    2, // 智力彩圈体力回复量
    {0, 0, 35, 0, 0, 0}, // 初期速耐力根智pt的提升
    20, // 初始羁绊
    0, // 赛后
    //友人卡的各种事件会另外处理
    {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    0  // 得意率
  },
  //2,高峰
  {
    2, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    35, // 友情加成
    0, // 干劲加成
    20, // 训练加成
    {0, 0, 0, 0, 2, 1}, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    5, // 初始羁绊
    0, // 赛后
    {0, 0, 0, 0, 0, 60}, // 为了简化，把红点的技能等效成多少属性
    60, // 启发发生率提升
    50  // 得意率
  },
  //3,美妙
  {
    3, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    37.5, // 友情加成
    30, // 干劲加成
    15, // 训练加成
    {0, 0, 0, 0, 1, 0}, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    {0, 0, 0, 0, 35, 0}, // 初期速耐力根智pt的提升
    15, // 初始羁绊
    10, // 赛后
    {0, 0, 0, 0, 0, 7}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    35  // 得意率
  },
  //4,乌拉拉
  {
    4, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    32, // 友情加成
    30, // 干劲加成
    15, // 训练加成
    {0, 0, 0, 0, 0, 1}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 35, 0, 0}, // 初期速耐力根智pt的提升
    0, // 初始羁绊
    10, // 赛后
    {1, 0, 1, 6, 0, 0}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    50  // 得意率
  },
  //5,根风神
  {
    5, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    20, // 友情加成
    30, // 干劲加成
    15, // 训练加成
    {1, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 35, 0, 0}, // 初期速耐力根智pt的提升
    35, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 30}, // 为了简化，把红点的技能等效成多少属性
    50, // 启发发生率提升
    80  // 得意率
  },
  //6，水司机
  {
    6, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    0, // 支援卡类型，0速1耐2力3根4智5友人或团队
    25, // 友情加成
    30, // 干劲加成
    25, // 训练加成
    {1, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    30, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 30}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    35  // 得意率
  },
  //7,根凯斯
  {
    7, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    50, // 干劲加成
    0, // 训练加成
    {0, 0, 2, 1, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 30, 0, 0, 0}, // 初期速耐力根智pt的提升
    20, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    65  // 得意率
  },
  //8,根皇帝
  {
    8, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    20, // 友情加成
    0, // 干劲加成
    10, // 训练加成
    {2, 0, 1, 2, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {20, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    25, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
    50, // 启发发生率提升
    65  // 得意率
  },
  //9,根善信
  {
    9, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    35, // 友情加成
    40, // 干劲加成
    5, // 训练加成
    {0, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 20, 0, 0}, // 初期速耐力根智pt的提升
    25, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    65  // 得意率
  },
  //10,速宝穴
  {
    10, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    0, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    0, // 干劲加成
    10, // 训练加成
    {3, 0, 1, 0, 0, 1}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {35, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    30, // 初始羁绊
    10, // 赛后
    {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    65  // 得意率
  },
  //11,耐海湾
  {
    11, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    1, // 支援卡类型，0速1耐2力3根4智5友人或团队
    37.5, // 友情加成
    0, // 干劲加成
    15, // 训练加成
    {0, 1, 0, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 35, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    30, // 初始羁绊
    10, // 赛后
    {0, 0, 0, 0, 0, 7}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    62  // 得意率
  },
  //12,智好歌剧
  {
    12, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    20, // 友情加成
    60, // 干劲加成
    10, // 训练加成
    {2, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    {0, 0, 0, 0, 20, 0}, // 初期速耐力根智pt的提升
    25, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 25}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    50  // 得意率
  },
};
