#include <iostream>
#include "GameDatabase.h"
#include "../SupportCard/SupportCard.h"
#include "../Game/Game.h"

//改天必须全部重写


// 0 模板
// 1 神团
// 2 智高峰
// 3 智美妙
// 4 根乌拉拉
// 5 根风神
// 6 水司机
// 7 根凯斯
// 8 根皇帝
// 9 根善信
// 10 速宝穴
// 11 耐海湾
// 12 智好歌剧
// 13 根黄金城
// ...懒得写了
//


const std::string GameDatabase::AllSupportCardNames[ALL_SUPPORTCARD_NUM] = {
  "模板",
  //1~6，我自己的卡组
  "[友]神团",
  "[智]高峰",
  "[智]美妙",
  "[根]乌拉拉",
  //5----
  "[根]风神",
  "[速]司机",
  //7~17 目前ue8用到过的卡组
  "[根]凯斯",
  "[根]皇帝",
  "[根]善信",
  //10----
  "[速]宝穴",
  "[耐]海湾",
  "[智]好歌剧",
  "[根]黄金城",
  "[智]波旁",
  //15----
  "[耐]狄杜斯",
  "[智]小栗帽",
  "[根]狄杜斯",

  //18~ 其他常用卡
  "[速]北黑",
  "[速]福来",
  //20----
  "[速]速子",

  "[耐]光钻",
  "[耐]桂冠",

  "[力]白仁",
  "[力]重炮",
  //25----
  "[力]内恰",
  "[力]神鹰",
  "[力]伏特加",

  "[根]涡轮",
  "[根]进王",
  //30----
  "[根]青竹",
  "[根]小栗帽sr",
  "[根]织姬sr",
  "[根]气槽sr",
  "[根]采珠sr",

  //35----
  "[智]东海",
  "[智]庆典",
  "[智]CB",
  "[智]小魔女",
  "[智]气槽",
  //40----
  "[智]太阳神hd",
  "[智]星云sr",
  "[智]速子sr",
  "[智]大和sr",
  "[智]福来sr",
  //45----
  "[根]也文",
  "[耐]特别周",
  "[根]特别周",
  "[速]阿尔丹",
  "[智]内恰",
  //50----
  "[力]八重",
};

const std::map<int, int> GameDatabase::AllSupportCardGameIdToSimulatorId =
{
  {0,0},
  {430137,1},
  {430134,2},
  {430010,3},
  {430019,4},

  {430011,5},
  {430107,6},
  {430130,7},
  {430037,8},
  {430027,9},

  {430147,10},
  {430016,11},
  {430152,12},
  {430153,13},
  {430141,14},

  {430099,15},
  {430146,16},
  {430063,17},
  {430028,18},
  {430078,19},

  {430101,20},
  {430029,21},
  {430142,22},
  {430123,23},
  {430151,24},

  {430138,25},
  {430007,26},
  {430005,27},
  {430112,28},
  {430083,29},

  {430094,30},
  {420048,31},
  {420041,32},
  {420004,33},
  {420029,34},

  {430111,35},
  {430108,36},
  {430097,37},
  {430128,38},
  {430124,39},

  {430155,40},
  {420050,41},
  {420012,42},
  {420002,43},
  {420016,44},

  {430126,45},
  {430127,46},
  {430105,47},
  {430119,48},
  {430054,49},

  {430032,50},
};

//这里的都包括固有，不满足固有条件的会在getCardEffect里校正
SupportCard GameDatabase::AllSupportCards[ALL_SUPPORTCARD_NUM] =
{
    //0，模板
    {
      0, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      0, // 支援卡类型，0速1耐2力3根4智5友人或团队
      0, // 友情加成
      0, // 干劲加成
      0, // 训练加成
      {0, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      0, // 初始羁绊
      0, // 赛后
      {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      0  // 得意率
    },
    //1,神团
    {
      1, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      5, // 支援卡类型，0速1耐2力3根4智5友人或团队
      32, // 友情加成
      15, // 干劲加成
      10, // 训练加成
      {1, 1, 1, 0, 0, 1}, // 速耐力根智pt的加成
      2, // 智力彩圈体力回复量
      {0, 0, 35, 0, 0, 0}, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      0, // 赛后
      //友人卡的各种事件会另外处理
      {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      0  // 得意率
    },
    //2,高峰
    {
      2, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      35, // 友情加成
      0, // 干劲加成
      20, // 训练加成
      {0, 0, 0, 0, 2, 1}, // 速耐力根智pt的加成
      5, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      5, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 30}, // 为了简化，把红点的技能等效成多少属性
      60, // 启发发生率提升
      50  // 得意率
    },
    //3,美妙
    {
      3, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      37.5, // 友情加成
      30, // 干劲加成
      15, // 训练加成
      {0, 0, 0, 0, 1, 0}, // 速耐力根智pt的加成
      5, // 智力彩圈体力回复量
      {0, 0, 0, 0, 35, 0}, // 初期速耐力根智pt的提升
      15, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 5}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      35  // 得意率
    },
    //4,乌拉拉
    {
      4, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      32, // 友情加成
      30, // 干劲加成
      15, // 训练加成
      {0, 0, 0, 0, 0, 1}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 35, 0, 0}, // 初期速耐力根智pt的提升
      0, // 初始羁绊
      10, // 赛后
      {1, 0, 1, 6, 0, 0}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      50  // 得意率
    },
    //5,根风神
    {
      5, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      30, // 干劲加成
      15, // 训练加成
      {1, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 35, 0, 0}, // 初期速耐力根智pt的提升
      35, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 20}, // 为了简化，把红点的技能等效成多少属性
      50, // 启发发生率提升
      80  // 得意率
    },
    //6，水司机
    {
      6, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      0, // 支援卡类型，0速1耐2力3根4智5友人或团队
      25, // 友情加成
      30, // 干劲加成
      25, // 训练加成
      {1, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 20}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      35  // 得意率
    },
    //7,根凯斯
    {
      7, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      30, // 友情加成
      50, // 干劲加成
      0, // 训练加成
      {0, 0, 2, 1, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 30, 0, 0, 0}, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      65  // 得意率
    },
    //8,根皇帝
    {
      8, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      0, // 干劲加成
      10, // 训练加成
      {2, 0, 1, 2, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {20, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      25, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      50, // 启发发生率提升
      65  // 得意率
    },
    //9,根善信
    {
      9, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      35, // 友情加成
      40, // 干劲加成
      5, // 训练加成
      {0, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 20, 0, 0}, // 初期速耐力根智pt的提升
      25, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      65  // 得意率
    },
    //10,速宝穴
    {
      10, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      0, // 支援卡类型，0速1耐2力3根4智5友人或团队
      30, // 友情加成
      0, // 干劲加成
      10, // 训练加成
      {3, 0, 1, 0, 0, 1}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {35, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      65  // 得意率
    },
    //11,耐海湾
    {
      11, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      1, // 支援卡类型，0速1耐2力3根4智5友人或团队
      37.5, // 友情加成
      0, // 干劲加成
      15, // 训练加成
      {0, 1, 0, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 35, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 5}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      62  // 得意率
    },
    //12,智好歌剧
    {
      12, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      60, // 干劲加成
      10, // 训练加成
      {2, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
      5, // 智力彩圈体力回复量
      {0, 0, 0, 0, 20, 0}, // 初期速耐力根智pt的提升
      25, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      50  // 得意率
    },
    //13,根黄金城
    {
      13, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      30, // 友情加成
      30, // 干劲加成
      5, // 训练加成
      {0, 0, 1, 3, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {20, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      35, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      50  // 得意率
    },
    //14，[智]波旁
    {
      14, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      30, // 友情加成
      0, // 干劲加成
      15, // 训练加成
      {1, 0, 0, 0, 2, 0}, // 速耐力根智pt的加成
      5, // 智力彩圈体力回复量
      {12,12,12,12,12, 0}, // 初期速耐力根智pt的提升。
      30, // 初始羁绊
      0, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      65 // 得意率
    },
    //15，[耐]狄杜斯
    {
      15, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      1, // 支援卡类型，0速1耐2力3根4智5友人或团队
      30, // 友情加成
      30, // 干劲加成
      20, // 训练加成
      {0, 1, 0, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 20, 0, 0}, // 初期速耐力根智pt的提升
      25, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      0  // 得意率
    },
    //16，[智]小栗帽
    {
      16, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      35, // 友情加成
      0, // 干劲加成
      10, // 训练加成
      {1, 0, 0, 0, 2, 0}, // 速耐力根智pt的加成
      5, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      15, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 8}, // 为了简化，把红点的技能等效成多少属性
      30, // 启发发生率提升
      50  // 得意率
    },
    //17根大脚
    {
      17, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      30, // 友情加成
      0, // 干劲加成
      10, // 训练加成
      {0, 0, 0, 1, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      15, // 赛后
      {0, 0, 0, 0, 0, 30}, // 为了简化，把红点的技能等效成多少属性
      50, // 启发发生率提升
      35  // 得意率
    },
    //18速北黑·
    {
      18, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      0, // 支援卡类型，0速1耐2力3根4智5友人或团队
      25, // 友情加成
      30, // 干劲加成
      15, // 训练加成
      {0, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      35, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 20}, // 为了简化，把红点的技能等效成多少属性
      30, // 启发发生率提升
      112  // 得意率
    },
    //19速福来
    {
      19, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      0, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      45, // 干劲加成
      10, // 训练加成
      {0, 0, 0, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {30, 30, 30, 30, 30, 0}, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      0  // 得意率
    },
    //20速速子
    {
      20, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      0, // 支援卡类型，0速1耐2力3根4智5友人或团队
      32, // 友情加成
      0, // 干劲加成
      5, // 训练加成
      {1, 0, 0, 0, 0, 2}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {35, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      0, // 赛后
      {0, 0, 0, 0, 0, 30}, // 为了简化，把红点的技能等效成多少属性
      50, // 启发发生率提升
      80  // 得意率
    },
    //21,耐光钻
  {
      21, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      1, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      55, // 干劲加成
      10, // 训练加成
      {0, 0, 0, 1, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 20, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      40, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      50  // 得意率
  },
  //22 耐桂冠
  {
      22, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      1, // 支援卡类型，0速1耐2力3根4智5友人或团队
      30, // 友情加成
      30, // 干劲加成
      5, // 训练加成
      {0, 3, 0, 0, 0, 1}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 10}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      50  // 得意率

  },
  //23 力白仁
  {
      23, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      2, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      0, // 干劲加成
      25, // 训练加成
      {0, 0, 0, 0, 0, 1}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      30, // 启发发生率提升
      65  // 得意率
  },
    //24，力重炮
    {
      24, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      2, // 支援卡类型，0速1耐2力3根4智5友人或团队
      35, // 友情加成
      20, // 干劲加成
      10, // 训练加成
      {0, 0, 1, 0, 0, 1}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 25, 0, 0, 0}, // 初期速耐力根智pt的提升
      35, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 30}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      65  // 得意率
    },
    //25，力内恰
    {
      25, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      2, // 支援卡类型，0速1耐2力3根4智5友人或团队
      30, // 友情加成
      30, // 干劲加成
      0, // 训练加成
      {0, 1, 3, 0, 0, 1}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 25, 0, 0, 0}, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 30}, // 为了简化，把红点的技能等效成多少属性
      50, // 启发发生率提升
      50  // 得意率
    },
    //26，力神鹰
    {
      26, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      2, // 支援卡类型，0速1耐2力3根4智5友人或团队
      32, // 友情加成
      40, // 干劲加成
      10, // 训练加成
      {0, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 20, 0, 0, 0}, // 初期速耐力根智pt的提升
      25, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      70  // 得意率
    },
    //27，力伏特加
    {
      27, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      2, // 支援卡类型，0速1耐2力3根4智5友人或团队
      48, // 友情加成
      40, // 干劲加成
      10, // 训练加成
      {0, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 20, 0, 0, 0}, // 初期速耐力根智pt的提升
      25, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 20}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      85  // 得意率
    },
    //28，根涡轮
    {
      28, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      43.75, // 友情加成
      0, // 干劲加成
      0, // 训练加成
      {2, 0, 1, 0, 0, 1}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      0, // 赛后
      {0, 0, 0, 0, 0, 10}, // 为了简化，把红点的技能等效成多少属性
      50, // 启发发生率提升
      65  // 得意率
    },
    //29，根进王
    {
      29, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      35, // 友情加成
      30, // 干劲加成
      20, // 训练加成
      {0, 0, 0, 1, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 30, 0, 0}, // 初期速耐力根智pt的提升
      25, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 20}, // 为了简化，把红点的技能等效成多少属性
      50, // 启发发生率提升
      0  // 得意率
    },
    //30，根青竹
    {
      30, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      38, // 友情加成
      0, // 干劲加成
      10, // 训练加成
      {1, 0, 0, 1, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      25, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      65  // 得意率
    },
    //31，根帽
    {
    31, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    0, // 干劲加成
    5, // 训练加成
    {1, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
    20, // 初始羁绊
    10, // 赛后
    {0, 0, 0, 0, 0, 20}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    50  // 得意率
    },
    //32，根织姬
    {
    32, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    30, // 干劲加成
    0, // 训练加成
    {1, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
    0, // 智力彩圈体力回复量
    {0, 0, 0, 20, 0, 0}, // 初期速耐力根智pt的提升
    20, // 初始羁绊
    15, // 赛后
    {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    35  // 得意率
    },
    //33根气曹
    {
    33, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    20, // 友情加成
    45, // 干劲加成
    10, // 训练加成
      { 0, 0, 0, 1, 0, 0 }, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      { 0, 0, 0, 0, 0, 0 }, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      10, // 赛后
      { 0, 0, 0, 0, 0, 15 }, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      60  // 得意率
    },
    //34根彩朱
    {
    34, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    3, // 支援卡类型，0速1耐2力3根4智5友人或团队
    43, // 友情加成
    40, // 干劲加成
    0, // 训练加成
      { 0, 0, 0, 0, 0, 1 }, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      { 0, 0, 0, 0, 0, 0 }, // 初期速耐力根智pt的提升
      40, // 初始羁绊
      5, // 赛后
      { 0, 0, 0, 0, 0, 10 }, // 为了简化，把红点的技能等效成多少属性
      30, // 启发发生率提升
      50  // 得意率
    },
    //35智东海
    {
    35, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    0, // 干劲加成
    20, // 训练加成
      { 1, 0, 0, 0, 2, 0 }, // 速耐力根智pt的加成
      5, // 智力彩圈体力回复量
      { 0, 0, 0, 0, 0, 0 }, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      5, // 赛后
      { 0, 0, 0, 0, 0, 20 }, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      35  // 得意率
    },
    //36庆典
    {
    36, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    20, // 友情加成
    60, // 干劲加成
    15, // 训练加成
    { 0, 0, 0, 0, 1, 1 }, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    { 0, 0, 0, 0, 0, 0 }, // 初期速耐力根智pt的提升
    20, // 初始羁绊
    10, // 赛后
    { 0, 0, 0, 0, 0, 30 }, // 为了简化，把红点的技能等效成多少属性
    50, // 启发发生率提升
    0  // 得意率
    },
    //37 CB
    {
    37, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    30, // 干劲加成
    5, // 训练加成
    { 1, 0, 0, 0, 2, 1 }, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    { 0, 0, 0, 0, 0, 0 }, // 初期速耐力根智pt的提升
    25, // 初始羁绊
    5, // 赛后
    { 0, 0, 0, 0, 0, 0 }, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    65  // 得意率
    },
    //38 小魔女
    {
    38, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    30, // 干劲加成
    0, // 训练加成
    { 0, 0, 0, 0, 2, 1 }, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    { 0, 0, 0, 0, 0, 0 }, // 初期速耐力根智pt的提升
    15, // 初始羁绊
    5, // 赛后
    { 0, 0, 0, 0, 0, 15 }, // 为了简化，把红点的技能等效成多少属性
    50, // 启发发生率提升
    75  // 得意率
    },
    //39智气槽
    {
    39, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    30, // 友情加成
    30, // 干劲加成
    0, // 训练加成
    { 2, 0, 0, 0, 1, 1 }, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    { 0, 0, 0, 0, 0, 0 }, // 初期速耐力根智pt的提升
    15, // 初始羁绊
    5, // 赛后
    { 0, 0, 0, 0, 0, 0 }, // 为了简化，把红点的技能等效成多少属性
    0, // 启发发生率提升
    65  // 得意率
    },
    //40，智太阳神
  {
    40, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
    4, // 支援卡类型，0速1耐2力3根4智5友人或团队
    15, // 友情加成
    50, // 干劲加成
    5, // 训练加成
    {1, 0, 0, 0, 1, 0}, // 速耐力根智pt的加成
    5, // 智力彩圈体力回复量
    {0, 0, 0, 0, 35, 0}, // 初期速耐力根智pt的提升
    25, // 初始羁绊
    5, // 赛后
    {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
    40, // 启发发生率提升
    75  // 得意率
  },
    //41，智sr星云
    {
      41, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      50, // 干劲加成
      10, // 训练加成
      {0, 0, 0, 0, 0, 1}, // 速耐力根智pt的加成
      4, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 10}, // 为了简化，把红点的技能等效成多少属性
     30, // 启发发生率提升
      50  // 得意率
    },
    //42智速子
    {
      42, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      40, // 干劲加成
      5, // 训练加成
      {0, 0, 0, 0, 1, 1}, // 速耐力根智pt的加成
      4, // 智力彩圈体力回复量
      {0, 0, 0, 0, 20, 0}, // 初期速耐力根智pt的提升
      25, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 0}, // 为了简化，把红点的技能等效成多少属性
      20, // 启发发生率提升
      50  // 得意率
    },
    //43，智大和
    {
      43, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      30, // 友情加成
      45, // 干劲加成
      0, // 训练加成
      {0, 0, 0, 0, 1, 0}, // 速耐力根智pt的加成
      4, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      40, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 10}, // 为了简化，把红点的技能等效成多少属性
      30, // 启发发生率提升
      50  // 得意率
    },
    //44，智福来
    {
      44, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      32, // 友情加成
      50, // 干劲加成
      5, // 训练加成
      {0, 0, 0, 0, 1, 0}, // 速耐力根智pt的加成
      4, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      40, // 初始羁绊
      0, // 赛后
      {0, 0, 0, 0, 0, 10}, // 为了简化，把红点的技能等效成多少属性
      40, // 启发发生率提升
      35  // 得意率
    },
    //45，也问
    {
      45, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      0, // 干劲加成
      15, // 训练加成
      {1, 0, 0, 1, 0, 2}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {30, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 10}, // 为了简化，把红点的技能等效成多少属性
      30, // 启发发生率提升
      35  // 得意率
    },
    //46耐特
    {
      46, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      1, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      0, // 干劲加成
      10, // 训练加成
      {0, 0, 0, 1, 0, 1}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 15}, // 为了简化，把红点的技能等效成多少属性
      50, // 启发发生率提升
      35  // 得意率
    },
    //47，根特
    {
      47, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      3, // 支援卡类型，0速1耐2力3根4智5友人或团队
      25, // 友情加成
      30, // 干劲加成
      5, // 训练加成
      {0, 0, 1, 1, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 35, 0, 0, 0}, // 初期速耐力根智pt的提升
      45, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 10}, // 为了简化，把红点的技能等效成多少属性
      30, // 启发发生率提升
      35  // 得意率
    },
    //48，速尔丹
    {
      48, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      0, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      60, // 干劲加成
      0, // 训练加成
      {1, 0, 2, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      30, // 初始羁绊
      5, // 赛后
      {0, 0, 0, 0, 0, 10}, // 为了简化，把红点的技能等效成多少属性
      0, // 启发发生率提升
      35  // 得意率
    },
    //49，智内恰
    {
      49, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      4, // 支援卡类型，0速1耐2力3根4智5友人或团队
      25, // 友情加成
      0, // 干劲加成
      15, // 训练加成
      {0, 0, 0, 0, 2, 0}, // 速耐力根智pt的加成
      5, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 10}, // 为了简化，把红点的技能等效成多少属性
      20, // 启发发生率提升
      35  // 得意率
    },

    //50，[力]八重无敌
    {
      50, // 支援卡id，部分卡具有比较复杂的固有，根据id来辨别
      2, // 支援卡类型，0速1耐2力3根4智5友人或团队
      20, // 友情加成
      40, // 干劲加成
      10, // 训练加成
      {0, 0, 1, 0, 0, 0}, // 速耐力根智pt的加成
      0, // 智力彩圈体力回复量
      {0, 0, 0, 0, 0, 0}, // 初期速耐力根智pt的提升
      20, // 初始羁绊
      10, // 赛后
      {0, 0, 0, 0, 0, 40}, // 为了简化，把红点的技能等效成多少属性
      60, // 启发发生率提升
      20  // 得意率
    },

};

CardTrainingEffect SupportCard::getCardEffect(const Game& game, int atTrain, int jiBan) const
{
    CardTrainingEffect effect =
    {
      youQingBasic,
      ganJingBasic,
      xunLianBasic,
      {bonusBasic[0],bonusBasic[1],bonusBasic[2],bonusBasic[3],bonusBasic[4],bonusBasic[5]},
      wizVitalBonusBasic
    };

    bool isShining = true;//是否闪彩
    if (cardType < 5)//速耐力根智卡
    {
        if (jiBan < 80)isShining = false;
        if (cardType != atTrain)isShining = false;
    }
    else if (GameDatabase::AllSupportCards[cardID].cardType == 5)//神团
    {
        if (!game.venusCardIsQingRe)
            isShining = false;
    }
    else std::cout << "未知卡";

    if (game.venusIsWisdomActive && game.venusAvailableWisdom == 3)//黄女神
        isShining = true;

    if (!isShining)
    {
        effect.youQing = 0;
    }
    if (!isShining || atTrain != 4)
        effect.vitalBonus = 0;

    //接下来是各种固有
    //1.神团
    if (cardID == 1)
    {
        if (jiBan < 100)
        {
            if (isShining)
                effect.youQing = 20;
            effect.ganJing = 0;
            effect.bonus[5] = 0;
        }
    }
    //2.高峰
    //为了简化，视为初始训练加成是4%，第一年逐渐增大到20%，也就是第n个回合4+n*(2/3)%
    else if (cardID == 2)
    {
        if (game.turn < 24)
            effect.xunLian = 4 + 0.6666667 * game.turn;
    }
    //3.美妙
    else if (cardID == 3)
    {
        //啥都没有
    }
    //4.根乌拉拉
    else if (cardID == 4)
    {
        //啥都没有
    }
    //5.根风神
    else if (cardID == 5)
    {
        //啥都没有
    }
    //6.水司机
    else if (cardID == 6)
    {
        int traininglevel = game.getTrainingLevel(atTrain);
        effect.xunLian = 5 + traininglevel * 5;
        if (effect.xunLian > 25)effect.xunLian = 25;
    }
    //7.根凯斯
    else if (cardID == 7)
    {
        if (jiBan < 80)
        {
            effect.bonus[2] = 0;
        }
    }
    //8.根皇帝
    else if (cardID == 8)
    {
        if (jiBan < 80)
        {
            effect.bonus[0] = 0;
        }
    }
    //9.根善信
    else if (cardID == 9)
    {
        //啥都没有
    }
    //10.速宝穴
    else if (cardID == 10)
    {
        if (jiBan < 100)
        {
            effect.bonus[0] = 0;
        }
    }
    //11.耐海湾
    else if (cardID == 11)
    {
        //啥都没有
    }
    //12.智好歌剧
    else if (cardID == 12)
    {
        if (jiBan < 80)
        {
            effect.bonus[0] = 0;
        }
    }
    //13.根黄金城
    else if (cardID == 13)
    {
        if (jiBan < 100)
        {
            effect.bonus[3] = 0;
        }
    }
    //14.智波旁
    else if (cardID == 14)
    {
        //啥都没有
    }
    //15.耐狄杜斯
    else if (cardID == 15)
    {
        int totalJiBan = 0;
        for (int i = 0; i < 6; i++)
            totalJiBan += game.cardJiBan[i];
        effect.xunLian = totalJiBan / 30;
    }
    //16.智小栗帽
    else if (cardID == 16)
    {
        //啥都没有
    }
    //17根大脚
    else if (cardID == 17) {
        //啥都没有
    }
    //速北黑
    else if (cardID == 18) {
        //啥都没有
    }
    //福来
    else if (cardID == 19) {
        //啥都没有
    }
    //速子
    else if (cardID == 20) {
        if (jiBan < 100)
        {
            effect.youQing = 22;
        }
    }
    //21耐光钻
    else if (cardID == 21)
    {
        //啥都没有
    }
    //22，耐桂冠
    else if (cardID == 22)
    {
      if (game.turn < 24)
        effect.bonus[1] = 1;
      else if (game.turn < 48)
        effect.bonus[1] = 2;
      else
        effect.bonus[1] = 3;
    }
    //23力白仁
    else if (cardID == 23)
    {
      int traininglevel = game.getTrainingLevel(atTrain);
      effect.xunLian = 5 + traininglevel * 5;
      if (effect.xunLian > 25)effect.xunLian = 25;
    }
    //24力重炮
    else if (cardID == 24)
    {
        if (jiBan < 100)
        {
            effect.xunLian = 0;
        }
    }
    //25力内恰
    else if (cardID == 25)
    {
      if (jiBan < 100)
      {
        effect.bonus[2] = 0;
      }
    }
    //28根涡轮
    else if (cardID == 28)
    {
      //以后再想办法
    }
    //29根进王
    else if (cardID == 29)
    {
      if (jiBan < 80 || atTrain == 3)
        effect.xunLian = 0;
    }
    //30根青竹
    else if (cardID == 30)
    {
      if (effect.youQing > 0)
      {
        float extraBonus = 5 + (100 - game.vital) / 7.0;
        if (extraBonus > 15)extraBonus = 15;
        if (extraBonus < 5)extraBonus = 5; // std::cout << effect.youQing << " ";

        effect.youQing = 120 * (1 + 0.01 * extraBonus) - 100;

      }

    }
    //也问
    else if (cardID == 45)
    {
        if (jiBan < 80)
        {

            effect.bonus[5] = 0;
        }
    }
    //耐特
    else if (cardID == 46)
    {
        if (isShining)
        {
            effect.ganJing = 60;
        }
    }
    //根特
    else if (cardID == 47)
    {
        //null
    }
    //速尔丹
    else if (cardID == 48)
    {
        if (jiBan < 80)
        {
            effect.bonus[2] = 0;
        }
    }
    //智内恰
    else if (cardID == 49)
    {
        //啥都没有
    }

    else
    {
      //  std::cout << "未知卡";
    }

    return effect;
}
